In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])

In [3]:
df1

   a  b
0  1  2
1  3  4

In [4]:
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

In [5]:
df2

   a  b
0  5  6
1  7  8

In [6]:
df=pd.concat([df1,df2],ignore_index=True)

In [7]:
df

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [8]:
df.drop(0)

   a  b
1  3  4
2  5  6
3  7  8

In [9]:
sr=pd.Series([12,34,56,566,765])

In [10]:
sr

0     12
1     34
2     56
3    566
4    765
dtype: int64

In [11]:
sr.truncate(before=3)

3    566
4    765
dtype: int64

In [12]:
sr.truncate(after=2)

0    12
1    34
2    56
dtype: int64

In [13]:
sr.truncate(before=2,after=3)

2     56
3    566
dtype: int64

In [14]:
dict={'name':['a','p','s','g'],
      'degree':['mba','bca','mtech','mba'],
      'score':[90,40,80,98]}

In [15]:
df=pd.DataFrame(dict)

In [16]:
df

  name degree  score
0    a    mba     90
1    p    bca     40
2    s  mtech     80
3    g    mba     98

In [17]:
for i,j in df.iterrows():
    print(i,j)

0 name        a
degree    mba
score      90
Name: 0, dtype: object
1 name        p
degree    bca
score      40
Name: 1, dtype: object
2 name          s
degree    mtech
score        80
Name: 2, dtype: object
3 name        g
degree    mba
score      98
Name: 3, dtype: object

In [18]:
for i in dict.items():
    print(i)

('name', ['a', 'p', 's', 'g'])
('degree', ['mba', 'bca', 'mtech', 'mba'])
('score', [90, 40, 80, 98])

In [19]:
for i,j in dict.items():
    print(i)
    print(j)

name
['a', 'p', 's', 'g']
degree
['mba', 'bca', 'mtech', 'mba']
score
[90, 40, 80, 98]

In [20]:
for i in dict.items():
    for j in i:
        print(j)

name
['a', 'p', 's', 'g']
degree
['mba', 'bca', 'mtech', 'mba']
score
[90, 40, 80, 98]

In [21]:
for i in dict:
    for j in dict[i]:
        print(i,j)

name a
name p
name s
name g
degree mba
degree bca
degree mtech
degree mba
score 90
score 40
score 80
score 98

In [22]:
for i in dict:
    for j in dict.items():
        print(j)

('name', ['a', 'p', 's', 'g'])
('degree', ['mba', 'bca', 'mtech', 'mba'])
('score', [90, 40, 80, 98])
('name', ['a', 'p', 's', 'g'])
('degree', ['mba', 'bca', 'mtech', 'mba'])
('score', [90, 40, 80, 98])
('name', ['a', 'p', 's', 'g'])
('degree', ['mba', 'bca', 'mtech', 'mba'])
('score', [90, 40, 80, 98])

In [23]:
import numpy as np
from numpy.random import randn

In [24]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['x','y','z','w'])

In [25]:
df

          x         y         z         w
a  0.134988 -0.511479  1.360803 -1.259625
b  1.682803 -0.587606 -0.623691  1.133476
c  0.416459 -0.047190  0.387885 -0.715814
d  0.354475 -1.482804 -0.001865 -0.946885
e -1.001541  1.088030 -0.931491 -0.005200

In [26]:
df < 0

       x      y      z      w
a  False   True  False   True
b  False   True   True  False
c  False   True  False   True
d  False   True   True   True
e   True  False   True   True

In [27]:
df['x']

a    0.134988
b    1.682803
c    0.416459
d    0.354475
e   -1.001541
Name: x, dtype: float64

In [28]:
df['x']>0

a     True
b     True
c     True
d     True
e    False
Name: x, dtype: bool

In [29]:
df[df['x']>0]

          x         y         z         w
a  0.134988 -0.511479  1.360803 -1.259625
b  1.682803 -0.587606 -0.623691  1.133476
c  0.416459 -0.047190  0.387885 -0.715814
d  0.354475 -1.482804 -0.001865 -0.946885

In [30]:
df > 0

       x      y      z      w
a   True  False   True  False
b   True  False  False   True
c   True  False   True  False
d   True  False  False  False
e  False   True  False  False

In [31]:
df

          x         y         z         w
a  0.134988 -0.511479  1.360803 -1.259625
b  1.682803 -0.587606 -0.623691  1.133476
c  0.416459 -0.047190  0.387885 -0.715814
d  0.354475 -1.482804 -0.001865 -0.946885
e -1.001541  1.088030 -0.931491 -0.005200

In [32]:
df[df['x']>0]['y']

a   -0.511479
b   -0.587606
c   -0.047190
d   -1.482804
Name: y, dtype: float64

In [33]:
df[df['x']>0][['y','x']]

          y         x
a -0.511479  0.134988
b -0.587606  1.682803
c -0.047190  0.416459
d -1.482804  0.354475

In [34]:
df[(df['x']>0) & (df['y']>1)]

Empty DataFrame
Columns: [x, y, z, w]
Index: []

In [35]:
df[(df['x']>0) | (df['y']>1)]

          x         y         z         w
a  0.134988 -0.511479  1.360803 -1.259625
b  1.682803 -0.587606 -0.623691  1.133476
c  0.416459 -0.047190  0.387885 -0.715814
d  0.354475 -1.482804 -0.001865 -0.946885
e -1.001541  1.088030 -0.931491 -0.005200

In [36]:
df[(df['x']>0) | (df['y']>1)]['w']

a   -1.259625
b    1.133476
c   -0.715814
d   -0.946885
e   -0.005200
Name: w, dtype: float64

In [37]:
df1 = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['x','y','z','w'])

In [38]:
df

          x         y         z         w
a  0.134988 -0.511479  1.360803 -1.259625
b  1.682803 -0.587606 -0.623691  1.133476
c  0.416459 -0.047190  0.387885 -0.715814
d  0.354475 -1.482804 -0.001865 -0.946885
e -1.001541  1.088030 -0.931491 -0.005200

In [39]:
df.reset_index()

  index         x         y         z         w
0     a  0.134988 -0.511479  1.360803 -1.259625
1     b  1.682803 -0.587606 -0.623691  1.133476
2     c  0.416459 -0.047190  0.387885 -0.715814
3     d  0.354475 -1.482804 -0.001865 -0.946885
4     e -1.001541  1.088030 -0.931491 -0.005200

In [40]:
outer = ['a','a','a','b','b','b']
inner = [1,2,3,1,2,3]

In [41]:
h_index = list(zip(outer,inner))

In [42]:
h_index

[('a', 1), ('a', 2), ('a', 3), ('b', 1), ('b', 2), ('b', 3)]

In [43]:
h_index=pd.MultiIndex.from_tuples(h_index)

In [44]:
h_index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3)],
           )

In [45]:
df2 = pd.DataFrame(randn(6,2))

In [46]:
df2

          0         1
0  0.769068 -0.726456
1 -0.605569  0.131304
2 -0.673206 -0.153421
3 -1.178067 -0.434640
4 -0.141851  1.029020
5  0.940345  0.496079

In [47]:
df2 = pd.DataFrame(randn(6,2),h_index)

In [48]:
df2

            0         1
a 1  1.585065  0.981931
  2 -0.041712 -1.765554
  3 -0.584420  0.463300
b 1 -1.037370 -0.941390
  2 -0.052557  0.324921
  3 -0.862403 -1.042543

In [49]:
df2 = pd.DataFrame(randn(6,2),h_index,['A','B'])

In [50]:
df2

            A         B
a 1  1.134801 -0.562103
  2  0.608359 -2.190743
  3  1.194018 -0.478730
b 1  0.665146 -0.906784
  2  0.167669 -0.077519
  3  0.517946  0.595144

In [51]:
df2.loc['a']

          A         B
1  1.134801 -0.562103
2  0.608359 -2.190743
3  1.194018 -0.478730

In [52]:
df2.loc['a'].loc[1]

A    1.134801
B   -0.562103
Name: 1, dtype: float64

In [53]:
df2.iloc[1].iloc[1]

-2.190742571922059

In [54]:
df2.loc['a'].loc[1].loc['B']

-0.562103338179265

In [55]:
df2.index.names = ['x','y']

In [56]:
df2

            A         B
x y
a 1  1.134801 -0.562103
  2  0.608359 -2.190743
  3  1.194018 -0.478730
b 1  0.665146 -0.906784
  2  0.167669 -0.077519
  3  0.517946  0.595144

In [ ]:
df3=pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])

In [58]:
df3

       col1      col2      col3
0 -0.810458  1.028080 -1.226704
1  0.355343 -0.468305  0.249485
2  1.788528 -0.594897 -0.067807
3  1.404171  0.582501  0.031879
4 -0.046362  1.065375 -1.131108
5  0.229293  1.104817  1.619234

In [59]:
df4=df3.rename(columns={'col1':'c1', 'col2':'c2','col3':'c3'},index={0:'apple',1:'banana',2:'durian'})

In [60]:
df4

              c1        c2        c3
apple  -0.810458  1.028080 -1.226704
banana  0.355343 -0.468305  0.249485
durian  1.788528 -0.594897 -0.067807
3       1.404171  0.582501  0.031879
4      -0.046362  1.065375 -1.131108
5       0.229293  1.104817  1.619234

In [61]:
df5=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['x','y','z','w'])

In [62]:
df5

          x         y         z         w
a  0.245345 -0.689486 -1.074624 -0.941590
b -1.531024 -0.439996 -1.039974  1.544238
c  0.188036 -0.633982  0.515273 -1.020616
d -0.658024  0.324211  1.059189  1.774158
e  1.024874 -0.067519 -1.247893  0.464751

In [63]:
df6=df5.reindex(index=['a','b','c','d','e'],columns=['x','y','b','d','z'])

In [64]:
df6

          x         y   b   d         z
a  0.245345 -0.689486 NaN NaN -1.074624
b -1.531024 -0.439996 NaN NaN -1.039974
c  0.188036 -0.633982 NaN NaN  0.515273
d -0.658024  0.324211 NaN NaN  1.059189
e  1.024874 -0.067519 NaN NaN -1.247893

In [65]:
df7=df5.reindex(index=['aA','b','c','d','e'],columns=['x','y','b','d','z'])

In [66]:
df7

           x         y   b   d         z
aA       NaN       NaN NaN NaN       NaN
b  -1.531024 -0.439996 NaN NaN -1.039974
c   0.188036 -0.633982 NaN NaN  0.515273
d  -0.658024  0.324211 NaN NaN  1.059189
e   1.024874 -0.067519 NaN NaN -1.247893

In [67]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[1,2,np.nan],'C':[1,2,np.nan]})

In [68]:
df

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  NaN  NaN  NaN

In [69]:
df['A'].isnull()

0    False
1    False
2     True
Name: A, dtype: bool

In [70]:
df.fillna(3)

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0

In [71]:
df['A'].notnull()

0     True
1     True
2    False
Name: A, dtype: bool

In [72]:
df=pd.DataFrame(np.random.randn(3,2),index=['a','c','e'],columns=['one','two'])

In [73]:
df=df.reindex(['a','b','c','d'])

In [74]:
df

        one       two
a  0.468682  0.127903
b       NaN       NaN
c  0.691346 -1.491546
d       NaN       NaN

In [75]:
df['one'].sum()

1.160028090179667

In [76]:
df['one'].count()

2

In [77]:
df.fillna(0)

        one       two
a  0.468682  0.127903
b  0.000000  0.000000
c  0.691346 -1.491546
d  0.000000  0.000000

In [78]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,10],'C':[10,np.nan,np.nan]})

In [79]:
df

     A     B     C
0  1.0   5.0  10.0
1  2.0   NaN   NaN
2  NaN  10.0   NaN

In [80]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [83]:
df.fillna(value=df.mean())

     A     B     C
0  1.0   5.0  10.0
1  2.0   7.5  10.0
2  1.5  10.0  10.0

In [88]:
df.fillna(value=df['A'].mean())

     A     B     C
0  1.0   5.0  10.0
1  2.0   1.5   1.5
2  1.5  10.0   1.5

In [89]:
df.fillna(value=df.sum())

     A     B     C
0  1.0   5.0  10.0
1  2.0  15.0  10.0
2  3.0  10.0  10.0